# 8.	Вам дан английский текст. Закодируйте его с помощью азбуки Морзе:
MORSE = {'A': '.-', 'B': '-...', 'C': '-.-.',
         'D': '-..', 'E': '.', 'F': '..-.',
         'G': '--.', 'H': '....', 'I': '..',
         'J': '.---', 'K': '-.-', 'L': '.-..',
         'M': '--', 'N': '-.', 'O': '---',
         'P': '.--.', 'Q': '--.-', 'R': '.-.',
         'S': '...', 'T': '-', 'U': '..-',
         'V': '...-', 'W': '.--', 'X': '-..-',
         'Y': '-.--', 'Z': '--..'}
#
# Входные данные
# Help me SOS
#
# Выходные данные
# 	.... . .-.. .--.
# -- .
# ... --- ...
#

user_str = input('Введите сообщение: ').upper().split()

for word in user_str:
    for letter in word:
        if letter in MORSE:
            print(MORSE[letter], end=' ')
    print()
